app/controllers/articles_controller.rb

  def update
  @article = Article.find(params[:id])
  @coupon.update = params[:article][:title]
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-03-05 16:20:09.192615"], ["id", 1]]